[
  {
    "id": "anger_1",
    "keywords": [
      "anger",
      "angry",
      "rage",
      "furious",
      "mad",
      "irritated",
      "temper",
      "hate"
    ],
    "source": "Bhagavad Gita 2.63",
    "verse": "krodhād bhavati sammohaḥ sammohāt smṛti-vibhramaḥ | smṛti-bhraṁśād buddhi-nāśo buddhi-nāśāt praṇaśyati ||",
    "translation": "From anger, complete delusion arises, and from delusion bewilderment of memory. When memory is bewildered, intelligence is lost, and when intelligence is lost one falls down again into the material pool.",
    "guidance": "Anger is a temporary madness that leads to permanent regret. When you feel rage rising, pause. Do not act. Your intelligence is being clouded. waiting even a moment can save you from a lifetime of regret."
  },
  {
    "id": "anger_2",
    "keywords": [
      "resentment",
      "hostility",
      "bitter",
      "grudge"
    ],
    "source": "Bhagavad Gita 16.21",
    "verse": "tri-vidhaṁ narakasyedaṁ dvāraṁ nāśanam ātmanaḥ | kāmaḥ krodhas tathā lobhas tasmād etat trayaṁ tyajet ||",
    "translation": "There are three gates leading to this hell—lust, anger and greed. Every sane man should give these up, for they lead to the degradation of the soul.",
    "guidance": "Anger is not power; it is a gateway to self-destruction. By harboring resentment, you are drinking poison and expecting the other person to die. Let it go for your own peace."
  },
  {
    "id": "fear_1",
    "keywords": [
      "fear",
      "afraid",
      "scared",
      "anxiety",
      "panic",
      "terrified",
      "nervous",
      "worry",
      "worried"
    ],
    "source": "Bhagavad Gita 2.40",
    "verse": "nehābhikrama-nāśo ’sti pratyavāyo na vidyate | sv-alpam apy asya dharmasya trāyate mahato bhayāt ||",
    "translation": "In this endeavor there is no loss or diminution, and a little advancement on this path can protect one from the most dangerous type of fear.",
    "guidance": "Fear often comes from the attachment to results. If you focus on the action itself—the effort, the duty—fear dissolves. Even a small step of courage protects you."
  },
  {
    "id": "fear_2",
    "keywords": [
      "worry",
      "future",
      "uncertainty"
    ],
    "source": "Bhagavad Gita 18.30",
    "verse": "pravṛttiṁ ca nivṛttiṁ ca kāryākārye bhayābhaye | bandhaṁ mokṣaṁ ca yā vetti buddhiḥ sā pārtha sāttvikī ||",
    "translation": "O son of Pṛthā, that understanding by which one knows what ought to be done and what ought not to be done, what is to be feared and what is not to be feared, what is binding and what is liberating, is in the mode of goodness.",
    "guidance": "Not all fear is bad; some keeps us safe. But fear of the unknown is unnecessary. Trust that you have the wisdom to handle whatever comes. You are equipped for your destiny."
  },
  {
    "id": "sadness_1",
    "keywords": [
      "sadness",
      "depressed",
      "grief",
      "loss",
      "crying",
      "unhappy",
      "pain",
      "sad",
      "low",
      "upset"
    ],
    "source": "Bhagavad Gita 2.22",
    "verse": "vāsāṁsi jīrṇāni yathā vihāya navāni gṛhṇāti naro ’parāṇi | tathā śarīrāṇi vihāya jīrṇāny anyāni saṁyāti navāni dehī ||",
    "translation": "As a person puts on new garments, giving up old ones, the soul similarly accepts new material bodies, giving up the old and useless ones.",
    "guidance": "This pain you feel is for something temporary. The soul is eternal. Relationships and situations change like clothes. Do not let the temporary define your eternal self."
  },
  {
    "id": "sadness_2",
    "keywords": [
      "sorrow",
      "heartbreak",
      "misery"
    ],
    "source": "Bhagavad Gita 2.14",
    "verse": "mātrā-sparśās tu kaunteya śītoṣṇa-sukha-duḥkha-dāḥ | āgamāpāyino ’nityās tāṁs titikṣasva bhārata ||",
    "translation": "O son of Kuntī, the nonpermanent appearance of happiness and distress, and their disappearance in due course, are like the appearance and disappearance of winter and summer seasons.",
    "guidance": "Happiness and distress come and go like seasons. They are sensory perceptions. Tolerate them without being disturbed. This too shall pass."
  },
  {
    "id": "confusion_1",
    "keywords": [
      "confusion",
      "indecision",
      "doubt",
      "lost",
      "unsure",
      "dilemma",
      "confused"
    ],
    "source": "Bhagavad Gita 18.66",
    "verse": "sarva-dharmān parityajya mām ekaṁ śaraṇaṁ vraja | ahaṁ tvāṁ sarva-pāpebhyo mokṣayiṣyāmi mā śucaḥ ||",
    "translation": "Abandon all varieties of religion and just surrender unto Me. I shall deliver you from all sinful reactions. Do not fear.",
    "guidance": "When logic fails and the path is unclear, surrender to the higher power. Trust your intuition and core values. You are being guided, even if you cannot see the destination yet."
  },
  {
    "id": "duty_1",
    "keywords": [
      "work",
      "job",
      "career",
      "duty",
      "lazy",
      "procrastination",
      "tired"
    ],
    "source": "Bhagavad Gita 2.47",
    "verse": "karmaṇy evādhikāras te mā phaleṣu kadācana | mā karma-phala-hetur bhūr mā te saṅgo ’stv akarmaṇi ||",
    "translation": "You have a right to perform your prescribed duty, but you are not entitled to the fruits of action. Never consider yourself the cause of the results of your activities, and never be attached to not doing your duty.",
    "guidance": "Do your work with full focus and passion, but release your grip on the outcome. Anxiety comes from worrying about the result. Peace comes from loving the process."
  },
  {
    "id": "lust_1",
    "keywords": [
      "lust",
      "desire",
      "craving",
      "temptation",
      "addiction"
    ],
    "source": "Bhagavad Gita 3.39",
    "verse": "āvṛtaṁ jñānam etena jñānino nitya-vairiṇā | kāma-rūpeṇa kaunteya duṣpūreṇānalena ca ||",
    "translation": "Thus the wise living entity's pure consciousness becomes covered by his eternal enemy in the form of lust, which is never satisfied and which burns like fire.",
    "guidance": "Desire is a fire that grows the more you feed it. Realize that lasting satisfaction comes from within, not from external objects or fleeting pleasures."
  },
  {
    "id": "peace_1",
    "keywords": [
      "peace",
      "calm",
      "stillness",
      "meditation",
      "stress"
    ],
    "source": "Bhagavad Gita 2.70",
    "verse": "āpūryamāṇam acala-pratiṣṭhaṁ samudram āpaḥ praviśanti yadvat | tadvat kāmā yaṁ praviśanti sarve sa śāntim āpnoti na kāma-kāmī ||",
    "translation": "A person who is not disturbed by the incessant flow of desires—that enter like rivers into the ocean, which is ever being filled but is always still—can alone achieve peace, and not the man who strives to satisfy such desires.",
    "guidance": "Be like the ocean. Rivers of demands and desires will flow into you, but do not let them disturb your depth. Remain vast and deep."
  },
  {
    "id": "envy_1",
    "keywords": [
      "jealous",
      "envy",
      "comparison",
      "others"
    ],
    "source": "Bhagavad Gita 12.13-14",
    "verse": "adveṣṭā sarva-bhūtānāṁ maitraḥ karuṇa eva ca | nirmamo nirahaṅkāraḥ sama-duḥkha-sukhaḥ kṣamī ||",
    "translation": "One who is not envious but is a kind friend to all living entities, who does not think himself a proprietor and is free from false ego, who is equal in both happiness and distress... is very dear to Me.",
    "guidance": "Comparison is the thief of joy. Celebrate others' success as your own, and your heart will expand. Your path is unique; do not measure it by another's ruler."
  },
  {
    "id": "loneliness_1",
    "keywords": [
      "lonely",
      "alone",
      "abandoned",
      "friend"
    ],
    "source": "Bhagavad Gita 6.5",
    "verse": "uddhared ātmanātmānaṁ nātmānam avasādayet | ātmaiva hy ātmano bandhur ātmaiva ripur ātmanaḥ ||",
    "translation": "One must deliver himself with the help of his mind, and not degrade himself. The mind is the friend of the conditioned soul, and his enemy as well.",
    "guidance": "You are never truly alone if you befriend your own mind. The divine resides within you. Connect with your inner self, and you will find the most loyal companion."
  },
  {
    "id": "death_1",
    "keywords": [
      "death",
      "dying",
      "mortality",
      "end"
    ],
    "source": "Bhagavad Gita 2.20",
    "verse": "na jāyate mriyate vā kadācin nāyaṁ bhūtvā bhavitā vā na bhūyaḥ | ajo nityaḥ śāśvato ’yaṁ purāṇo na hanyate hanyamāne śarīre ||",
    "translation": "For the soul there is neither birth nor death at any time. He has not come into being, does not come into being, and will not come into being. He is unborn, eternal, ever-existing and primeval. He is not slain when the body is slain.",
    "guidance": "Death is but a changing of clothes for the soul. The essence of who you are, or who your loved one is, is eternal and indestructible."
  },
  {
    "id": "discipline_1",
    "keywords": [
      "discipline",
      "focus",
      "distraction",
      "study"
    ],
    "source": "Bhagavad Gita 6.26",
    "verse": "yato yato niścalati manaś cañcalam asthiram | tatas tato niyamyaitad ātmany eva vaśaṁ nayet ||",
    "translation": "From wherever the mind wanders due to its flickering and unsteady nature, one must certainly withdraw it and bring it back under the control of the self.",
    "guidance": "The mind is like a restless child. Do not get angry when it wanders; simply, gently, and repeatedly bring it back to your task. This constant practice is the path to mastery."
  },
  {
    "id": "arrogance_1",
    "keywords": [
      "pride",
      "ego",
      "arrogant",
      "better",
      "superior"
    ],
    "source": "Bhagavad Gita 13.8",
    "verse": "amānitvam adambhitvam ahiṁsā kṣāntir ārjavam | ācāryopāsanaṁ śaucaṁ sthairyam ātma-vinigrahaḥ ||",
    "translation": "Humility; pridelessness; nonviolence; tolerance; simplicity; approaching a bona fide spiritual master; cleanliness; steadiness; self-control...",
    "guidance": "True strength comes from humility. The tree that bends in the storm survives; the rigid one breaks. Let go of the need to be 'right' or 'superior'."
  }
]